Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/european_education_programmes/europass.html.txt.tmx
Source language: en
Languages: ga

source: Europass is an EU initiative to help people make their skills, and qualifications clearly understood throughout Europe
ga: Tionscnamh de chuid an AE is ea Europass a chabhróidh le daoine a chur in iúl go soiléir ó cheann ceann na hEorpa céard iad na cáilíochtaí agus na scileanna atá acu

source: Europass brings together documents that have been developed at European level to facilitate the movement of both learners and workers throughout Europe
ga: Forbraíodh doiciméid ar leibhéal Eorpach le cabhrú le foghlamóirí agus oibrithe araon gluaiseacht ar fud na hEorpa agus déanann an Europass iad sin a cumasc le chéile

source: These documents are Europass CV, Europass Language Passport, Europass Mobility Document, Europass Certificate Supplement and Europass Diploma Supplement (described in detail in ‘Rules’ below)
ga: Séard atá sna doiciméid seo ná CV Europass, Pas Teangacha Europass, Doiciméad Soghluaiseachta Europass, Teastas Forlíonta Europass agus Dioplóma Forlíonta Europass (a bhfuil mionchur síos orthu sna 'Rialacha' thíos)

source: The 5 documents are collectively referred to as the Europass Portfolio
ga: Tugtar an Mála Cáipéise Europass ar an 5 dhoiciméad seo mar aonad

source: People can use Europass documents when they are seeking jobs and when they wish to enter education and training programmes
ga: Is féidir le daoine doiciméid Europass a úsáid nuair atá postanna uathu agus nuair is mian leo clárú i gcláir oideachais agus oiliúna

source: The documents are especially helpful when people move between countries to work because they make it easier for employers to understand the qualifications and competences of job seekers from other EU Member States
ga: Tá na doiciméid seo fíor-úsáideach go mór mór nuair a ghluaiseann daoine ó thír go tír le dul ag obair mar cabhraíonn siad leis na fostóirí a thuiscint céard iad na cáilíochtaí agus na hinniúlachtaí éagsúla atá ag daoine ó Bhallstáit eile den AE is atá ar lorg postanna

source: Europass also helps education, training and guidance practitioners to advise people about the most suitable learning paths and opportunities
ga: Cabhraíonn Europass freisin le múinteoirí, lucht oiliúna agus gairmthreoraithe an chomhairle is fearr a thabhairt do dhaoine maidir leis na deiseanna foghlamtha agus deiseanna eile is oiriúnaí dóibh

source: Europass CV is a standard CV format you can use to detail your qualifications and skills in a straightforward and understandable manner
ga: Tá an gnáth leagan amach CV ar an CV Europass agus is féidir leat sonraí faoi do cháilíochtaí agus do scileanna a chur ann ar bhealach simplí sothuigthe

source: The Europass CV can be completed online at the Europass portal
ga: Ní miste an CV Europass a chomhlánú ar líne ag an tairseach faisnéise Europass

source: Europass Language Passport allows you to describe and detail your language skills and competences
ga: Cuireann Pas Teangacha Europass ar do chumas mionchur síos a dhéanamh ar na scileanna agus an inniúlacht atá agat i gcás teangacha

source: It is a self-assessment document and allows the user to detail their ability to understand, speak and write a language
ga: Déanann an duine féin measúnú sa doiciméad ar an cumas atá aige nó aici teanga a thuiscint, a labhairt agus a scríobh

source: The Europass Language Passport can be completed online at the Europass portal
ga: Ní miste an CV Europass a chomhlánú ar líne ag an tairseach faisnéise Europass

source: Europass Mobility is a personal document, which is used to record an organised period of time (a mobility experience) that a person spends in another European country for the purpose of learning or training
ga: Doiciméad pearsanta is ea Soghluaiseacht Europass ina dhéantar cur síos ar thréimhse eagraithe a chaith duine i dtír Eorpach eile ar mhaithe le foghlaim nó oiliúint

source: This might include a work placement in a company or an academic term as part of an exchange programme
ga: Taithí soghluaiseachta a thugtar ar an tréimshe sin. D'fhéadfadh socrúchán oibre i gcomhlacht a bheith i gceist anseo nó téarma acadúil mar chuid de chlár malartáin

source: The mobility experience is monitored by two partner organisations, the first in the country of origin and the second in the host country. Both partners agree on the purpose, content and duration of the experience and a mentor is identified in the host country
ga: Déanann an dá eagraíocht chomhpháirtíochta monatóireacht ar an taithí soghluaiseachta seo, ceann acu sa tír ónar tháinig an duine agus an ceann eile sa tír a théann sé nó sí chuici

source: The partners can be universities, schools, training centres, companies and Non-Governmental Organisations (NGOs)
ga: Socraíonn an dá chomhpháirtí eatarthu féin céard iad cuspóir, ábhar agus faid an taithí agus ainmníonn siad duine mar chomhairleoir sa tír óstach

source: You obtain the Europass Mobility by contacting the organisation sending you abroad and asking them to contact the National Europass Centre
ga: Is féidir le hollscoileanna, scoileanna, ionaid traenála, comhlachtaí agus eagraíochtaí neamhrialtasacha a bheith ina gcomhpháirtithe

source: Europass Certificate Supplement provides extra information about vocational education and training awards
ga: Tugann Forlíonadh ar Theastas Europass breis eolais faoi dhámhachtainí gairme agus oiliúna

source: It supplements the original certificate, making it more easily understood, especially by employers or institutions outside the issuing country
ga: Cuireann sé leis an mbunteastas sa slí is go bhfuil sé níos fusa lena thuiscint, go mór mór ag fostóirí agus institiúidí lasmuigh den tír inar eisíodh é

source: Europass Diploma Supplement is issued to graduates of higher educations institutions along with their degree or diploma
ga: Eisíonn institiúidí ardoideachais Forlíonadh ar an Dioplóma Europass nuair atá céim nó dioplóma á bhronnadh acu ar chéimithe

source: It helps to ensure that higher education qualifications are more easily understood, especially outside the country where they were awarded
ga: Is cabhair é seo lena chinntiú go dtuigfear na cáilíochtaí ardoideachais seo go mór mór lasmuigh den tír inar eisíodh iad

source: There is no charge for the Europass document and application is free of charge
ga: Níl aon táille ar an doiciméad Europass agus is saor in aisce é an t-iarratas

source: However, there is also no funding available under this programme towards the costs of the period of training abroad
ga: Níl aon chistiú ar fáil, ámh, faoin gclár seo i leith chostais na tréimhse oiliúna thar lear

source: EU funding is available for mobility programmes through Erasmus +
ga: Bíonn fáil ar chistiú ón EU ar son chláir shoghluaisteachta tríd Erasmus+

source: The National Europass Centres are the first point of contact for any person or organisation interested in using or learning more about Europass
ga: Más mian le duine nó le heagraíocht fáil amach faoi Europass nó leas a bhaint as ba chóir dóibh dul i dteagmháil leis an Lárionad Náisiúnta Europass ar dtús

source: Quality and Qualifications Ireland (QQI) is the designated National Europass Centre in Ireland
ga: Is é Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE) atá ainmnithe mar Lárionad Europass Náisiúnta na hÉireann
